bench/results/java25/20260425T080143Z/load.stdout.txt
{"ok": true, "tool": "wrk", "url": "http://localhost:8080/api/gateway/orders", "method": "GET", "duration_s": 120, "warmup_s": 60, "concurrency": 25, "threads": 4, "body_file": null, "header_file": null, "requests_per_sec": 4966.0, "p50": "4.59ms", "p95": "8.31ms", "p99": "9.82ms", "http_non2xx": "na", "socket_errors": {}, "raw_excerpt": "Running 2m test @ http://localhost:8080/api/gateway/orders\n  4 threads and 25 connections\n  Thread Stats   Avg      Stdev     Max   +/- Stdev\n    Latency     4.84ms    1.58ms  30.48ms   73.44%\n    Req/Sec     1.25k   123.45     1.46k    81.02%\n  Latency Distribution\n     50%    4.59ms\n     75%    5.64ms\n     90%    6.81ms\n     99%    9.82ms\n  596275 requests in 2.00m, 135.91MB read\nRequests/sec:   4966.00\nTransfer/sec:      1.13MB"}